def draw_pattern():
    width = 40
    thickness = 2
    gap1 = (width//2) - (thickness//2) ## Расстояние до центральной верт. полосы
    gap2 = (width//4) - (thickness//2) ## Расстояние до нижних верт. полос
    gap3 = width - ((gap2 * 2) + (thickness*2)) ## Расстояние между нижними верт. полосами
    print(f"\033[48;2;255;255;255m{' ' * width}\033[0m") ## Горизонтальная полоса
    print(f"{' ' * gap1}\033[48;2;255;255;255m{' ' * thickness}\033[0m") ## Вертикальная полоса 1
    print(f"\033[48;2;255;255;255m{' ' * width}\033[0m")  ## Горизонтальная полоса
    print(f"{' ' * gap2}\033[48;2;255;255;255m{' ' * thickness}\033[0m{' ' * gap3}\033[48;2;255;255;255m{' ' * thickness}\033[0m")  ##
    print(f"\033[48;2;255;255;255m{' ' * width}\033[0m")  ## Горизонтальная полоса
